# Ultralytics YOLO 🚀, AGPL-3.0 license
# SWCB-YOLO: Swin-transformer and Frequency-Spatial dual-domain attention YOLO.
# Lightweight wind-turbine-blade defect detector built on YOLOv11n.
#
# This configuration wires the two learnable feature components of the paper into the
# YOLOv11n graph:
#   * AS-Swin2 (ASSwin2)  - asymmetric strip Swin-TransformerV2 blocks in the deep backbone,
#                           giving anisotropic receptive fields aligned with slender cracks.
#   * FS-DDA   (FS_DDA)   - frequency-spatial dual-domain attention at deep neck fusion nodes,
#                           separating high-frequency clutter from weak defect edges.
# The third contribution, the CA-Shape-IoU loss, is enabled at train time via the
# `cashapeiou: True` hyperparameter and needs no architectural change (it is inference-free).

# Parameters
nc: 3 # number of classes (crack, spalling, dirt). Override per dataset via the data YAML.
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# SWCB-YOLO backbone (YOLOv11n stem + AS-Swin2 deep stages)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, ASSwin2, [512, 2, 4, 7]] # 6  AS-Swin2 (P4): [c2, depth, heads, window]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, ASSwin2, [1024, 2, 8, 7]] # 8  AS-Swin2 (P5): [c2, depth, heads, window]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# SWCB-YOLO head (bidirectional neck + FS-DDA refinement at deep fusion nodes)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13
  - [-1, 1, FS_DDA, []] # 14  FS-DDA refinement at the P4 fusion node

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19 cat head P4
  - [-1, 2, C3k2, [512, False]] # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 10], 1, Concat, [1]] # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)
  - [-1, 1, FS_DDA, []] # 24  FS-DDA refinement at the P5 fusion node

  - [[17, 20, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
